print('hello world')
# Задание номер 1
print('1', '2', '3', sep='*')
print('1', '2', '3', '4', sep='^', end='\n')
# Задание номер 3
num = int(input('Введите число:\n'))
result = num - 1
print(result)
